app/views/job_posts/_form.html.haml

SELECT "categories".* FROM "categories"
---
= simple_form_for(@job_post, html: { class: 'form-horizontal'}) do |f|
        = f.collection_select :category_id, Category.all, :id, :name, {promt:"C>