app/controllers/job_posts_controller.rb

  def index
    if params[:category].blank?
      @job_posts = JobPost.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @job_posts = JobPost.where(category_id: @category_id).order("created_at DESC")
---
SELECT "categories".* FROM "categories"
SELECT "job_posts".* FROM "job_posts" ORDER BY created_at DESC
SELECT "categories".* FROM "categories" WHERE "categories"."name" = ? LIMIT ?  [["name", "Full Time"], ["LIMIT", 1]]
SELECT "job_posts".* FROM "job_posts" WHERE "job_posts"."category_id" = ? ORDER BY created_at DESC  [["category_id", 1]]

  def create
    @job_post = JobPost.new(job_posts_params)

    if @job_post.save
---
INSERT INTO "job_posts" ("title", "description", "company", "url", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def update
    if @job_post.update(job_posts_params)
---
UPDATE "job_posts" SET "description" = ?, "updated_at" = ? WHERE "job_posts"."id" = ?  [["description", "hhhhhhhhu"], ["updated_at", "2024-05-04 21:27:50.514743"], ["id", 5]]

  def destroy
    @job_post.destroy
---
DELETE FROM "job_posts" WHERE "job_posts"."id" = ?  [["id", 1]]

  def find_job_post
    @job_post = JobPost.find(params[:id])
---
SELECT "job_posts".* FROM "job_posts" WHERE "job_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]