app/views/layouts/application.html.haml

                                        %li= link_to "All Jobs", root_path
                                        - Category.all.each do |category|
---
SELECT "categories".* FROM "categories"